import {AfterViewInit, Component, HostListener, OnInit, ViewEncapsulation} from '@angular/core';
import {Meta, Title} from '@angular/platform-browser';


@Component({
  selector: 'app-services',
  templateUrl: './services.component.html',
  styleUrls: ['./services.component.scss'],
  encapsulation: ViewEncapsulation.None
})
export class ServicesComponent implements OnInit {
  title = ' Прибирання ціни | Клінінгова компанія Clinko | Львів';
  flatCleaningInfo: any = {
    name: 'Генеральне прибирання ',
    mainInfo: ['Видаляємо пил з усіх поверхонь;',
      'миємо раковину, плиту, холодильник і меблі на кухні зовні;',
      'очищаємо від бруду і жиру всі кухонні поверхні;',
      'миємо і поліруємо дзеркала і скляні поверхні;',
      'миємо і протираємо всі предмети інтер\'єру;',
      'миємо і поліруємо меблі і меблеву фурнітуру;',
      'протираємо карнізи і видаляємо павутиння;',
      'відпарювачем чистимо штори та тюлі (по домовленості);',
      'миємо підвіконня та радіатори;',
      'миємо двері, рами, ручки, вимикачі;',
      'миємо і дезінфікуємо ванну кімнату, туалет;',
      'миємо підлогу, плінтуса.'
    ],
    additionalInfo: [
      {
        name: 'КУХНЯ',
        services: [ '- газова плита;', '- раковина;', '- всі поверхні;',
          '- витирання пилу;', '- підвіконня, батарея;', '- миття підлоги, плінтусів;', '- миття дверей, ручки, вимикачі.'
        ]
      },
      {
        name: 'КІМНАТА',
        services: ['- протирання всіх доступних поверхонь;', '- дзеркала і скляні поверхні;',
          '- підвіконня, батарея;', '- світильники;', '- двері, ручки, вимикачі;',
          '- поліровка меблів;', '- сухий пилосос, миття підлоги, плінтусів.']
      },
      {
        name: 'САНВУЗОЛ',
        services: ['- миття, дезінфекція ванни, унітазу;', '- раковини;',
          '- дзеркала;', '- сантехніка; ', '- миття плитки, підлоги;', '- двері, ручки, вимикачі.']
      },
      {
        name: 'ДОДАТКОВО',
        services: [ '- Холодильник в середині', '- духовка', '- мікрохвильовка',
          '- гриль', '- відпарювання і чистка штор ', '- відпарювання, розглажування одягу ',
          '- виносимо побутове сміття.'
        ]
      }
    ],
    prices: [
      {
        name: 'Квартира без меблів ',
        price: '30 грн.\\м.2',
      },
      {
        name: 'Квартира з меблями  ',
        price: '35 грн.\\м.2',
      },
      {
        name: 'Миття вікон',
        price: '35 грн.\\м.2 ',
      },
      {
        name: 'Миття вікон після ремонту ',
        price: '40 грн.\\м.2',
      },
    ]
  };
  cleaningAfterRepair: any = {
    name: 'прибирання аісля ремонту',
    mainInfo: [
      'Прибираємо залишки бруду після ремонтних робіт ( цемент, гіпс, краплі фарби, скотч);',
      'Миємо люстри і світильники;', 'миємо двері, рами, ручки, вимикачі;',
      'чистимо зовні побутову техніку;', 'миємо і поліруємо меблі і дзеркала;',
      'миємо підвіконня і радіатори;', 'пилососимо м\'які меблі, клими, підлогу;',
      'миємо підлогу, плінтуса;', 'миємо і дезинфікуємо санвузли.'
    ],
    attentionInfo: 'Під час такого прибирання використовуються сильно діючі хімічні засоби!',
    prices: [
      {
        name: 'Прибирання після ремонту ',
        price: '30-40 грн.\\м.2',
      },
    ]
  };
  regularCleaning: any = {
    name: 'Періодичне прибирання квартир',
    mainInfo: [
      'Видаляємо пил з усіх відкритих поверхонь;', 'миємо раковину, плиту на кухні;',
      'протираємо всю побутову техніку;', 'протираємо карнізи, видаляємо павутиння;',
      'миємо і поліруємо дзеркала і скляні поверхні;', 'сухим пилососом чистимо м\'які меблі, килими, підлогу;',
      'протираємо двері, рами, вимикачіґ. світильники (крім люстр);',
      'миємо підлогу, плінтуса, підвіконня;',
      'миємо ванну, унітаз'
    ],
    attentionInfo: 'Ціна орієнтовна і залежить від ступеня забруднення і специфіки приміщеня',
    prices: [
      {
        name: 'Періодичне прибирання квартир ',
        price: '20-25 грн.\\м.2\n',
      },
    ]
  };
  carpetCleaning: any = {
    name: 'Хімчтстка',
    mainInfo: false,
    prices: [
      {
        name: 'Ковролін ( синтетика) ворс до 2 см. ',
        price: '40 грн\\м.2'
      },
      {
        name: 'Ковролін ( синтетика) ворс від 2 см., шерсть ',
        price: '50 грн.\\м.2'
      },
      {
        name: 'Великий кутовий диван ',
        price: '600-800грн '
      },
      {
        name: 'Великий шкіряний диван',
        price: '800-1000 грн.'
      },
      {
        name: 'Малий кутовий диван ',
        price: '500 - 600 грн.'
      },
      {
        name: 'Великий кутовий диван ',
        price: '600-800 грн.'
      },
      {
        name: 'Диван ',
        price: '500 - 600 грн.  '
      },
      {
        name: 'Великий диван ',
        price: '600-800 грн.'
      },
      {
        name: 'Крісло ',
        price: '150 - 250 грн.  '
      },
      {
        name: 'Велике крісло ',
        price: '250-400 грн. '
      },
      {
        name: 'Одне сидяче місце',
        price: '150- 200 грн.'
      }
    ]
  };
  windowCleaning: any = {
    prices: [
      {
        name: 'Двостулкове вікно ',
        price: '75 грн.',
      },
      {
        name: 'Двостулкове вікно (з хімчисткою віконної рами) ',
        price: '150 грн.',
      },
      {
        name: 'Тристулкове вікно з одним відкриванням',
        price: '125 грн.',
      },
      {
        name: 'Тристулкове вікно з одним відкриванням (з хімчисткою віконної рами)',
        price: '250 грн.',
      },
      {
        name: 'Балконні вікна',
        price: '250 грн.',
      },
      {
        name: 'Балконні вікна (з хімчисткою віконної рами)',
        price: '500 грн.',
      }
    ]
  };
  additionalServices: any = {
      name: 'Додаткові послуги',
      prices: [
        {
          name: 'Холодильник в середині ',
          price: '150-250 грн.'
        },
        {
          name: 'Духовка ',
          price: '150-250 грн.'
        },
        {
          name: 'Мікрохвильова піч ',
          price: '100 грн.'
        },
        {
          name: 'Гриль ',
          price: '200-300 грн.'
        },
        {
          name: 'Відпарювання та чистка штор',
          price: '20 грн.\\м.2'
        },
        {
          name: 'Відпарювання, розглажування одягу',
          price: '50 грн.\\шт.'
        },
        {
          name: 'Виносимо побутове сміття.',
          price: 'договірна'
        }
      ]
  };
  choosenService: any;
  isPricesColapsed: boolean = true;
  constructor(private titleService: Title, private meta: Meta) {
  }

  ngOnInit() {
    this.meta.updateTag({
      name: 'keywords', content: 'Прибирання квартир ціни, ' +
        ' прибирання після ремонту ціни,' +
        ' миття вікон , ' +
        'прибирання ціни' +
        ' хімчистка меблів ціни ' +
        'клінінгова компанія ціни',
    });
    this.meta.updateTag({
      name: 'description', content: 'Послуги:' +
        '-генеральне прибирання;' +
        '-хімчистка меблів;' +
        '-миття вікон; ' +
        '-прибирання в неробочий та нічний час львів;' +
        '-прибирання після ремонту львів,'
    });
    this.titleService.setTitle(this.title);
  }
}
